gatling-existing.yml
---
execution:
- executor: gatling
  scenario: existing

  concurrency:
    local: 20
    cloud: 1000
  ramp-up: 1m
  steps: 3
  hold-for: 10m

  locations:
    us-east-1: 50
    us-west-1: 50
    eu-west-1: 50
    eu-west-2: 50

scenarios:
  existing:
    script: blazedemo.scala
    simulation: examples.gatling.blazedemo