gatling-existing.yml
---
execution:
- executor: gatling
  scenario: existing

  concurrency: 2000
  ramp-up: 1m
  steps: 3
  hold-for: 5m

  locations:
    eu-west-1: 50
    eu-west-2: 50

scenarios:
  existing:
    script: blazedemo.scala
    simulation: examples.gatling.blazedemo

modules:
  cloud:
    test: Jenkins 2K users Gatling Test