script1.yml
---
execution:
- concurrency: 10000
  hold-for: 10m
  ramp-up: 2m
  locations:
    us-east-1: 5
    us-west-1: 5
    us-east-2: 5
    eu-west-1: 5
  locations-weighted: false
  scenario: Thread Group
scenarios:
  Thread Group:
    requests:
    - label: blazedemo
      method: GET
      url: http://blazedemo.com/
    - body:
        fromPort: Paris
        toPort: Buenos Aires
      label: reserve
      method: POST
      url: http://blazedemo.com/reserve.php